### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.caf.azurecaf_name.public_ip_addresses["example_vm_pip1_rg1"] will be created
+   resource "azurecaf_name" "public_ip_addresses" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "example_vm_pip1"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_public_ip"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.random_string.prefix[0] will be created
+   resource "random_string" "prefix" {
+       id          = (known after apply)
+       length      = 4
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.caf.module.keyvaults["example_vm_rg1"].azurecaf_name.keyvault will be created
+   resource "azurecaf_name" "keyvault" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "vmlinuxakv"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_key_vault"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.keyvaults["example_vm_rg1"].azurerm_key_vault.keyvault will be created
+   resource "azurerm_key_vault" "keyvault" {
+       access_policy                   = (known after apply)
+       enable_rbac_authorization       = false
+       enabled_for_deployment          = false
+       enabled_for_disk_encryption     = true
+       enabled_for_template_deployment = false
+       id                              = (known after apply)
+       location                        = "uksouth"
+       name                            = (known after apply)
+       purge_protection_enabled        = true
+       resource_group_name             = (known after apply)
+       sku_name                        = "standard"
+       soft_delete_enabled             = (known after apply)
+       soft_delete_retention_days      = 7
+       tags                            = {
+           "env" = "Standalone"
        }
+       tenant_id                       = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
+       vault_uri                       = (known after apply)

+       network_acls {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)
        }

+       timeouts {
+           delete = "60m"
        }
    }

  # module.caf.module.networking["vnet_region1"].azurecaf_name.caf_name_vnet will be created
+   resource "azurecaf_name" "caf_name_vnet" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "virtual_machines"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_virtual_network"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.networking["vnet_region1"].azurerm_virtual_network.vnet will be created
+   resource "azurerm_virtual_network" "vnet" {
+       address_space         = [
+           "10.100.100.0/24",
        ]
+       guid                  = (known after apply)
+       id                    = (known after apply)
+       location              = "uksouth"
+       name                  = (known after apply)
+       resource_group_name   = (known after apply)
+       subnet                = (known after apply)
+       tags                  = {
+           "module" = "virtual_network"
        }
+       vm_protection_enabled = false
    }

  # module.caf.module.public_ip_addresses["example_vm_pip1_rg1"].azurerm_public_ip.pip will be created
+   resource "azurerm_public_ip" "pip" {
+       allocation_method       = "Static"
+       fqdn                    = (known after apply)
+       id                      = (known after apply)
+       idle_timeout_in_minutes = 4
+       ip_address              = (known after apply)
+       ip_version              = "IPv4"
+       location                = "uksouth"
+       name                    = (known after apply)
+       resource_group_name     = (known after apply)
+       sku                     = "Standard"
+       tags                    = {
+           "module" = "public_ip_addresses"
        }
    }

  # module.caf.module.resource_groups["vm_region1"].azurecaf_name.rg will be created
+   resource "azurecaf_name" "rg" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "brainboard-demo-rg1"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_resource_group"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.resource_groups["vm_region1"].azurerm_resource_group.rg will be created
+   resource "azurerm_resource_group" "rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = (known after apply)
    }

  # module.caf.module.virtual_machines["example_vm1"].azurecaf_name.disk["data1"] will be created
+   resource "azurecaf_name" "disk" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "server1-data1"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_managed_disk"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.virtual_machines["example_vm1"].azurecaf_name.linux["linux"] will be created
+   resource "azurecaf_name" "linux" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "example_vm1"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_linux_virtual_machine"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.virtual_machines["example_vm1"].azurecaf_name.linux_computer_name["linux"] will be created
+   resource "azurecaf_name" "linux_computer_name" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "example_vm1"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_linux_virtual_machine"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.virtual_machines["example_vm1"].azurecaf_name.nic["nic0"] will be created
+   resource "azurecaf_name" "nic" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "0"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_network_interface"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.virtual_machines["example_vm1"].azurecaf_name.os_disk_linux["linux"] will be created
+   resource "azurecaf_name" "os_disk_linux" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "example_vm1-os"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_managed_disk"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.virtual_machines["example_vm1"].azurerm_key_vault_secret.ssh_private_key["linux"] will be created
+   resource "azurerm_key_vault_secret" "ssh_private_key" {
+       id             = (known after apply)
+       key_vault_id   = (known after apply)
+       name           = (known after apply)
+       value          = (sensitive value)
+       version        = (known after apply)
+       versionless_id = (known after apply)
    }

  # module.caf.module.virtual_machines["example_vm1"].azurerm_key_vault_secret.ssh_public_key_openssh["linux"] will be created
+   resource "azurerm_key_vault_secret" "ssh_public_key_openssh" {
+       id             = (known after apply)
+       key_vault_id   = (known after apply)
+       name           = (known after apply)
+       value          = (sensitive value)
+       version        = (known after apply)
+       versionless_id = (known after apply)
    }

  # module.caf.module.virtual_machines["example_vm1"].azurerm_linux_virtual_machine.vm["linux"] will be created
+   resource "azurerm_linux_virtual_machine" "vm" {
+       admin_username                  = "adminuser"
+       allow_extension_operations      = true
+       computer_name                   = (known after apply)
+       disable_password_authentication = true
+       eviction_policy                 = "Deallocate"
+       extensions_time_budget          = "PT1H30M"
+       id                              = (known after apply)
+       location                        = "uksouth"
+       max_bid_price                   = -1
+       name                            = (known after apply)
+       network_interface_ids           = (known after apply)
+       platform_fault_domain           = -1
+       priority                        = "Spot"
+       private_ip_address              = (known after apply)
+       private_ip_addresses            = (known after apply)
+       provision_vm_agent              = true
+       public_ip_address               = (known after apply)
+       public_ip_addresses             = (known after apply)
+       resource_group_name             = (known after apply)
+       size                            = "Standard_F2"
+       tags                            = {
+           "module" = "virtual_machine"
        }
+       virtual_machine_id              = (known after apply)
+       zone                            = (known after apply)

+       admin_ssh_key {
+           public_key = (known after apply)
+           username   = "adminuser"
        }

+       boot_diagnostics {}

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       os_disk {
+           caching                   = "ReadWrite"
+           disk_size_gb              = (known after apply)
+           name                      = (known after apply)
+           storage_account_type      = "Standard_LRS"
+           write_accelerator_enabled = false
        }

+       source_image_reference {
+           offer     = "UbuntuServer"
+           publisher = "Canonical"
+           sku       = "18.04-LTS"
+           version   = "latest"
        }
    }

  # module.caf.module.virtual_machines["example_vm1"].azurerm_managed_disk.disk["data1"] will be created
+   resource "azurerm_managed_disk" "disk" {
+       create_option        = "Empty"
+       disk_iops_read_write = (known after apply)
+       disk_mbps_read_write = (known after apply)
+       disk_size_gb         = 10
+       id                   = (known after apply)
+       location             = "uksouth"
+       name                 = (known after apply)
+       resource_group_name  = (known after apply)
+       source_uri           = (known after apply)
+       storage_account_type = "Standard_LRS"
+       tags                 = {
+           "module" = "virtual_machine"
        }
+       zones                = [
+           "1",
        ]
    }

  # module.caf.module.virtual_machines["example_vm1"].azurerm_network_interface.nic["nic0"] will be created
+   resource "azurerm_network_interface" "nic" {
+       applied_dns_servers           = (known after apply)
+       dns_servers                   = (known after apply)
+       enable_accelerated_networking = false
+       enable_ip_forwarding          = false
+       id                            = (known after apply)
+       internal_dns_name_label       = "nic0"
+       internal_domain_name_suffix   = (known after apply)
+       location                      = "uksouth"
+       mac_address                   = (known after apply)
+       name                          = (known after apply)
+       private_ip_address            = (known after apply)
+       private_ip_addresses          = (known after apply)
+       resource_group_name           = (known after apply)
+       tags                          = {
+           "module" = "virtual_machine"
        }
+       virtual_machine_id            = (known after apply)

+       ip_configuration {
+           name                          = (known after apply)
+           primary                       = true
+           private_ip_address            = (known after apply)
+           private_ip_address_allocation = "dynamic"
+           private_ip_address_version    = "IPv4"
+           public_ip_address_id          = (known after apply)
+           subnet_id                     = (known after apply)
        }
    }

  # module.caf.module.virtual_machines["example_vm1"].azurerm_virtual_machine_data_disk_attachment.disk["data1"] will be created
+   resource "azurerm_virtual_machine_data_disk_attachment" "disk" {
+       caching                   = "None"
+       create_option             = "Attach"
+       id                        = (known after apply)
+       lun                       = 1
+       managed_disk_id           = (known after apply)
+       virtual_machine_id        = (known after apply)
+       write_accelerator_enabled = false
    }

  # module.caf.module.virtual_machines["example_vm1"].tls_private_key.ssh["linux"] will be created
+   resource "tls_private_key" "ssh" {
+       algorithm                  = "RSA"
+       ecdsa_curve                = "P224"
+       id                         = (known after apply)
+       private_key_pem            = (sensitive value)
+       public_key_fingerprint_md5 = (known after apply)
+       public_key_openssh         = (known after apply)
+       public_key_pem             = (known after apply)
+       rsa_bits                   = 4096
    }

  # module.caf.module.networking["vnet_region1"].module.subnets["example"].azurecaf_name.subnet will be created
+   resource "azurecaf_name" "subnet" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "examples"
+       passthrough   = false
+       prefixes      = [
+           "demo",
        ]
+       random_length = 0
+       resource_type = "azurerm_subnet"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       use_slug      = true
    }

  # module.caf.module.networking["vnet_region1"].module.subnets["example"].azurerm_subnet.subnet will be created
+   resource "azurerm_subnet" "subnet" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.100.100.0/29",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = (known after apply)
+       resource_group_name                            = (known after apply)
+       service_endpoints                              = []
+       virtual_network_name                           = (known after apply)
    }

  # module.caf.module.keyvaults["example_vm_rg1"].module.initial_policy[0].module.logged_in_user["logged_in_user"].azurerm_key_vault_access_policy.policy will be created
+   resource "azurerm_key_vault_access_policy" "policy" {
+       id                 = (known after apply)
+       key_vault_id       = (known after apply)
+       object_id          = "4300fc00-0311-4b58-9eca-6e871df84c82"
+       secret_permissions = [
+           "Set",
+           "Get",
+           "List",
+           "Delete",
+           "Purge",
+           "Recover",
        ]
+       tenant_id          = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"

+       timeouts {
+           delete = "60m"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```
</details>